{"id":32,"date":"2015-04-06T06:13:08","date_gmt":"2015-04-06T06:13:08","guid":{"rendered":"https:\/\/ostif.org\/?page_id=32"},"modified":"2017-03-29T00:51:24","modified_gmt":"2017-03-29T00:51:24","slug":"security-audits-what-they-are-and-why-they-matter","status":"publish","type":"page","link":"https:\/\/ostif.org\/security-audits-what-they-are-and-why-they-matter\/","title":{"rendered":"Security Audits &#8211; What They Are and Why They Matter"},"content":{"rendered":"<h1><a title=\"Security Audits - What They Are and Why They Matter\" href=\"https:\/\/ostif.org\/security-audits-what-they-are-and-why-they-matter\/\">Security Audits &#8211; What They Are and Why They Matter<\/a><\/h1>\n<p>Writing code is a long error prone process for even the most experienced programmer. Writing secure code for encryption requires advanced knowledge in multiple completely independent fields of computing including secure programming methods, hardware, operating systems, advanced mathematics, and a strong grasp of common attacks against the kind of code you are creating. In a world where a tiny gap of knowledge in any of these topics can create a void that gets exploited by criminals and governments alike it takes extraordinary vigilance to verify the integrity of code and ensure that experts agree that the code is invulnerable to all known attacks.<\/p>\n<p>The OSTIF periodically gets code audited by elite professionals (both companies and individuals), who comb through the code line-by-line and look for possible exploits. It is important that open source security software goes through this process on a regular basis as the code is so complex that only a handful of people (less than 10000) in the world are truly qualified to audit it with the level of scrutiny that allows the entire world to trust their results.<\/p>\n<p>Auditing is a complex and labor-intensive process. The most simple type is basic scanning by specialized software to look for errors in code that can lead to security vulnerabilities. There&#8217;s also more complex types which involve looking at the code line-by-line for common coding errors that software will routinely miss, but still create flaws, and the most advanced type of auditing involves threat modeling, which is the process of figuring out the sophistication of a likely attacker, and how they would try to attack the software, and then manually searching for flaws in the software based on how it actually behaves, as well as taking a look at the most important pieces of the source code. OSTIF hires individuals and firms to look at the source code of the supported applications using all of these available methods.<\/p>\n<p>The process is detailed in the image below!<\/p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter wp-image-629\" src=\"https:\/\/ostif.org\/wp-content\/uploads\/2016\/11\/Audit-Cycle.png\" alt=\"audit-cycle\" width=\"1367\" height=\"1066\" srcset=\"https:\/\/ostif.org\/wp-content\/uploads\/2016\/11\/Audit-Cycle.png 1856w, https:\/\/ostif.org\/wp-content\/uploads\/2016\/11\/Audit-Cycle-300x234.png 300w, https:\/\/ostif.org\/wp-content\/uploads\/2016\/11\/Audit-Cycle-768x599.png 768w, https:\/\/ostif.org\/wp-content\/uploads\/2016\/11\/Audit-Cycle-1024x798.png 1024w\" sizes=\"(max-width: 1367px) 100vw, 1367px\" \/><\/p>\n<p>This, combined with our commitment to maintaining bug bounties, will allow continued external community support for the projects that is crucial to building trust and the strongest possible software engineering.<\/p>\n<p>&nbsp;<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Security Audits &#8211; What They Are and Why They Matter Writing code is a long error prone process for even the most experienced programmer. Writing secure code for encryption requires advanced knowledge in multiple completely independent fields of computing including secure programming methods, hardware, operating systems, advanced mathematics, and a strong grasp of common attacks [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"open","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/pages\/32"}],"collection":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/comments?post=32"}],"version-history":[{"count":17,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/pages\/32\/revisions"}],"predecessor-version":[{"id":828,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/pages\/32\/revisions\/828"}],"wp:attachment":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/media?parent=32"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}