{"id":710,"date":"2016-12-19T03:42:53","date_gmt":"2016-12-19T03:42:53","guid":{"rendered":"https:\/\/ostif.org\/?p=710"},"modified":"2019-05-23T01:06:58","modified_gmt":"2019-05-23T01:06:58","slug":"the-openvpn-fundraiser-has-hit-its-goal-work-on-the-audit-begins","status":"publish","type":"post","link":"https:\/\/ostif.org\/the-openvpn-fundraiser-has-hit-its-goal-work-on-the-audit-begins\/","title":{"rendered":"The OpenVPN Fundraiser Has Hit It&#8217;s Goal &#8211; Work On The Audit Begins"},"content":{"rendered":"<h1><a href=\"https:\/\/ostif.org\/?p=710\">The OpenVPN Fundraiser Has Hit It&#8217;s Goal &#8211; Work On The Audit Begins<\/a><\/h1>\n<p>We are delighted to announce that the Open Source Technology Improvement Fund has surpassed it&#8217;s target goal of<strong> $71,000 USD<\/strong> with two weeks of fundraising to spare! We are continuing to seek donations until fundraising officially ends on January 1st.<\/p>\n<h2>Our community: A coalition for positive change and a stronger OpenVPN.<\/h2>\n<p>This accomplishment is due to an overwhelmingly strong response from the community, where we have built a coalition of 33 companies and many individuals who have donated and helped spread the word about our cause.<\/p>\n<p>We want to give a special thank you to our largest supporters <a href=\"https:\/\/www.privateinternetaccess.com\/\">Private Internet Access<\/a> and <a href=\"https:\/\/www.ipredator.se\/\">iPredator<\/a>, whose generous contributions make up more than half of the total money raised! Their help is instrumental in making this audit happen and moving the effort forward. We also want to thank ThatOnePrivacyGuy from <a href=\"https:\/\/thatoneprivacysite.net\/\">ThatOnePrivacySite<\/a> for helping us create incentives for VPN providers to contribute to the cause through a special recognition category for VPNs that contribute back to the privacy community. And a special thank you to the Reddit community for helping us spread the word around the world about our cause.<\/p>\n<h2>Why does fundraising continue? Where does money raised beyond the goal go?<\/h2>\n<p>The overflow funds are being reserved for the bug bounty program that will begin after the OpenSSL audit finishes in mid 2017. This will be a program where researchers can submit new security bugs to the developers of the projects that have already been audited by OSTIF for up to $5000 in rewards. When this program begins, it will cover VeraCrypt, OpenVPN, and OpenSSL and OSTIF will need a $50,000 pool to set aside for award payouts that will need to be periodically replenished by donations overages from other projects. The bug-bounty program is the crucial next-step in improving our supported apps. It draws in the attention of reverse-engineers, white hats, and academics to do additional research into the functionality of the apps and find irregularities that can lead to security vulnerabilities. After a professional audit, bringing the eyes of the crypto world to the project is what will keep these apps as strong as they can possibly be.<\/p>\n<h2>What is the next step in the OpenVPN audit process?<\/h2>\n<p>Now that we have the funds, we will contact QuarksLab and reserve a team of two senior researchers to conduct the audit. We have decided internally that because we already have a world-renowned cryptographer auditing the core crypto of OpenVPN (Dr Matthew Green), our team of researchers will focus on software vulnerabilities and exploit analysis. We think that these combinations of skills will lead to the best possible analysis of OpenVPN as a whole.<\/p>\n<p>We have a tentative agreement for the head of our QuarksLab team to be Gabriel Campana. Those in security circles might remember his recent impressive <a href=\"http:\/\/blog.quarkslab.com\/xen-exploitation-part-3-xsa-182-qubes-escape.html\">Qubes OS + Xen Paravirtualization escape exploit<\/a>. This elegant exploit chain allowed an attacker to take full control of a Xen based server that was running Qubes OS, one of the most security focused Linux distros today. In the demonstration, a simple script allowed the user to escape the Qubes instance and take full control of any other instance in the machine, regardless of permissions. We can also see some of his excellent <a href=\"https:\/\/conference.hitb.org\/hitbsecconf2012kul\/materials\/D1T3%20-%20F%20Raynal%20&amp;%20G%20Campana%20-%20An%20Attack%20Path%20to%20Jailbreaking%20Your%20Home%20Router.pdf\">audit work on set-top boxes here<\/a>.<\/p>\n<h1>Thank You All For Supporting OSTIF<\/h1>\n<p>This is an enormous accomplishment for OSTIF and the privacy community. Thank you to each and every person who contributed to the project by donating and spreading the word. We are going to continue to do great things and make a real difference in the safety of the digital world that we all share.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The OpenVPN Fundraiser Has Hit It&#8217;s Goal &#8211; Work On The Audit Begins We are delighted to announce that the Open Source Technology Improvement Fund has surpassed it&#8217;s target goal of $71,000 USD with two weeks of fundraising to spare! We are continuing to seek donations until fundraising officially ends on January 1st. Our community: [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[70,61,68,59,60],"tags":[83,84,21],"_links":{"self":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts\/710"}],"collection":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/comments?post=710"}],"version-history":[{"count":3,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts\/710\/revisions"}],"predecessor-version":[{"id":714,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts\/710\/revisions\/714"}],"wp:attachment":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/media?parent=710"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/categories?post=710"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/tags?post=710"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}