{"id":2144,"date":"2020-06-12T15:13:39","date_gmt":"2020-06-12T15:13:39","guid":{"rendered":"https:\/\/ostif.org\/?page_id=2144"},"modified":"2020-06-12T15:13:39","modified_gmt":"2020-06-12T15:13:39","slug":"why-ostif-what-ostif-does-for-your-open-source-project","status":"publish","type":"page","link":"https:\/\/ostif.org\/why-ostif-what-ostif-does-for-your-open-source-project\/","title":{"rendered":"Why OSTIF? &#8211; What OSTIF Does for your Open Source Project"},"content":{"rendered":"<p>Software security is complex, and the process of finding appropriate security engineers with the right scope and price is even more difficult. OSTIF&#8217;s role in the open source community is to help projects get through the process with as few headaches as possible with full transparency and trust. All too often, projects are overpaying on rates, hours, or for unqualified contractors to review their code.<\/p>\n<p>OSTIF provides:<\/p>\n<p>Assistance with Scoping &#8211; We help identify appropriate areas of code coverage for your project&#8217;s security review, and select a scope that gives your project the most benefit based on your projects use-case, the codebase itself, your dependencies, and the security practices that your project already utilizes. Appropriate scoping reduces costs while making security review more effective by allowing the engineers to spend their time in the most effective areas.<\/p>\n<p>Assistance with Pricing &#8211; We have spent years building a network of vetted security partners, whom all bid on your project. This acts as an aggressive price control that saves projects that work with us thousands every year, while only allowing top security professionals with novel published research in your projects scope to review your project.<\/p>\n<p>Assistance with Quality Control &#8211; We closely monitor the audit process as it proceeds, and act as a mediator in disputes over the reporting and severity of security bugs that are found. Reports are repeatedly revised until all parties are happy with the content of the report before public disclosure.<\/p>\n<p>Assistance with Banking &#8211; Many open source projects are not full business entities with bank accounts or staff. OSTIF can provide a place to fund-raise for your project without needlessly spending months creating a formal business entity.<\/p>\n<p>Nonprofit Status &#8211; OSTIF is a 501(c)3 charitable organization, keyed under scientific research. Donations to OSTIF are tax write offs in the United States. This can encourage corporate donations in your project&#8217;s security review.<\/p>\n<p>Remediation &#8211; We instruct our security teams to seek opportunities to close classes of bugs from projects. If the auditors spot an issue that seems to reoccur multiple times throughout the same review, they are instructed to provide remediation steps so that not only are the existing bugs squashed, but an improvement in practices can permanently prevent the issue from reoccurring as the project continues to develop and grow.<\/p>\n<p>Transparency &#8211; OSTIF acts as a neutral third party. We always disclose our work to the public in full, with a short synopsis page that describes the review in a ~10 minute read, and with the full paper available for public consumption. This provides your project with more than increased trust from the public; It provides OSTIF with a peer review process that allows critique of our work and results, and it allows administrators and developers around the world to consider your project for integration into their work.<\/p>\n<p>MORE &#8211; Every project is unique. We consider the novel challenges that every project faces, and work to help solve those problems.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Software security is complex, and the process of finding appropriate security engineers with the right scope and price is even more difficult. OSTIF&#8217;s role in the open source community is to help projects get through the process with as few headaches as possible with full transparency and trust. All too often, projects are overpaying on [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"_links":{"self":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/pages\/2144"}],"collection":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/comments?post=2144"}],"version-history":[{"count":1,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/pages\/2144\/revisions"}],"predecessor-version":[{"id":2145,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/pages\/2144\/revisions\/2145"}],"wp:attachment":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/media?parent=2144"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}