{"id":2730,"date":"2022-08-26T18:06:41","date_gmt":"2022-08-26T18:06:41","guid":{"rendered":"https:\/\/ostif.org\/?p=2730"},"modified":"2022-08-26T18:06:41","modified_gmt":"2022-08-26T18:06:41","slug":"ostif-partners-with-omidyar-network","status":"publish","type":"post","link":"https:\/\/ostif.org\/ostif-partners-with-omidyar-network\/","title":{"rendered":"OSTIF Partners with Omidyar Network"},"content":{"rendered":"<p>Open Source Technology Improvement Fund is thrilled to announce its first philanthropic partnership with <a href=\"https:\/\/omidyar.com\/\">Omidyar Network<\/a> (ON). OSTIF is joining a strong network of open source advocates and specialists under the ON portfolio to further the Open and Secure Internet Ecosystem.<\/p>\n<p><em>“This is a significant accomplishment for OSTIF and expands our network with tech philanthropy. Omidyar Network’s support will augment our commitment to a strong and secure open source ecosystem”<\/em> said Amir Montazery, Managing Director of OSTIF.<\/p>\n<p>While OSTIFs primary focus is helping projects improve security posture through audits, supply chain review, building security tools, and providing fixes, this partnership focuses on fundraising and messaging. Improving OSTIFs messaging and extending reach will help the organization gain new partnerships and magnify our impact. This positive feedback loop will continue to help OSTIF grow and add services to our already comprehensive work.<\/p>\n<p>This partnership comes at a perfect time for OSTIF, as the organization is releasing Impact Reports from its current partnerships (see: <a href=\"https:\/\/www.cncf.io\/blog\/2022\/08\/08\/improving-cncf-security-posture-with-independent-security-audits\/\">CNCF Impact Report<\/a> post) and fundraising for 2023. With over 150 security vulnerabilities found and fixed, including 10 critical severity and 25 high severity fixes in the first half of 2022 alone, OSTIF is growing its impact on improving the security of the open source ecosystem. Recent fixes include Remote Code Execution (RCE), Denial of Service (DOS), and Cross-Site Scripting (XSS) vulnerabilities in tech stacks used in a majority of global cloud vendors and their clients. For OSTIF, more funding means more security audits, more vulnerability fixes, and greater improvement to open source projects.<\/p>\n<p>A big thank you to Govind Shivkumar of Omidyar Network, Michael Brennan from the <a href=\"https:\/\/www.fordfoundation.org\/\">Ford Foundation<\/a>, and Kim Lewandowski of <a href=\"https:\/\/www.chainguard.dev\/\">Chainguard<\/a> for all their help and support in getting this partnership off the ground.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Open Source Technology Improvement Fund is thrilled to announce its first philanthropic partnership with Omidyar Network (ON). OSTIF is joining a strong network of open source advocates and specialists under the ON portfolio to further the Open and Secure Internet Ecosystem. “This is a significant accomplishment for OSTIF and expands our network with tech philanthropy. [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":2732,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[65,66,67],"tags":[176,175,174],"_links":{"self":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts\/2730"}],"collection":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/comments?post=2730"}],"version-history":[{"count":1,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts\/2730\/revisions"}],"predecessor-version":[{"id":2731,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts\/2730\/revisions\/2731"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/media\/2732"}],"wp:attachment":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/media?parent=2730"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/categories?post=2730"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/tags?post=2730"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}