{"id":378,"date":"2016-01-09T05:32:59","date_gmt":"2016-01-09T05:32:59","guid":{"rendered":"https:\/\/ostif.org\/?p=378"},"modified":"2019-05-23T01:33:50","modified_gmt":"2019-05-23T01:33:50","slug":"kickstarter-lessons-and-our-fundraising-future","status":"publish","type":"post","link":"https:\/\/ostif.org\/kickstarter-lessons-and-our-fundraising-future\/","title":{"rendered":"Kickstarter Lessons and Our Fundraising Future"},"content":{"rendered":"<p>Our KickStarter has just ended and we have learned a lot about how to raise money for our supported projects. We faced a number of challenges that were difficult to overcome in the short window that we had while the KickStarter was live. We have extensively evaluated every aspect of the effort and got tons of feedback from donors and potential donors on how to improve our processes. Our graphic below shows the changes we are making to the fundraising process. The goal is to simplify and streamline the process so that we can focus our energy on a single project at a time, and have a concrete message about what we want to do for that project.<\/p>\n<h1>The lessons that we learned from our first crowdsourcing effort.<\/h1>\n<p>The experience gave us a huge amount of information on how to conduct our efforts going forward, and allows us to narrow our focus on our goals and getting things done. Below are the areas that we have identified that we need to resolve before our next fundraiser.<\/p>\n<ol>\n<li><strong>Our fundraising effort was too broad.  <\/strong>This muddied our message and goals, and made our goals very hard to describe in a straight forward and easy to understand way. Our feedback indicated that people did not understand completely <span style=\"color: #000000;\">what<\/span> we do, the software that we support already exists and it is available for use now. The original hope was that we could combine all of the efforts into a single large KickStarter hoping that we could catch small donations from users of the various projects, and it would add up to the sums that we need to raise in order to accomplish our goals. It had the opposite effect, making the KickStarter goals vague and dissuading donors from donating because we had no system in place for users to earmark money for the project that they prefer. We plan to remedy this by doing focused crowdsourcing campaigns for supported applications. This allows us to focus our message on a particular app rather than a broad abstract concept.<\/li>\n<li><strong>KickStarter backers want some sort of &#8220;value&#8221; from their donation.<\/strong> Backers on KickStarter generally do not donate solely out of kindness. We did have KickStarter rewards, but our costs were relatively high on those rewards, and this meant that we had to raise significantly more money than our actual goal in order to compensate for the Certificates and T-Shirts. We are revisiting this rewards system to both bring down costs and bring down our donation rewards thresholds. This will allow us to do more with smaller donations, and donors will feel that they are getting a better value for their product.<\/li>\n<li><strong>The privacy community is insular and resistant to new entrants.<\/strong> We expected stronger community support on social media from the security and privacy community. The response was lackluster to say the least. Everyone agreed that our goals were both important and reachable, but people were resistant to support the cause on social media. This greatly limited our reach. We also had a lot of trouble reaching out to media groups and bloggers for public comments on our efforts. Most personalities in the privacy world simply ignored our requests and didn&#8217;t even ask us questions or respond to requests for comment. To build trust with our potential donors, we are working with well-known groups in the community to get &#8220;observers&#8221; on the project who will look over our processes, contracts, goals and fundraising and verify that everything is in good order and reasonable. We also think that getting a single audit under our belts will give people more confidence that we can handle actually achieving our goals and delivering results.<\/li>\n<li><strong>The vast majority of the potential backers on crowdsourcing sites are unfamiliar with our supported software. <\/strong>This leads to issues with converting potential donors to backers of our projects. People do not know what the software does or what it is for. This problem will be made simpler by focusing our message on a single piece of software in smaller funding projects. We plan to also tackle this problem by posting thorough guides on what the software does, how it works, and showing in detail how to use the software through intuitive videos. We think that showing the usefulness of the software, as well as giving people an avenue to use it themselves without having to read complex manuals will help to bring about more conversions and get us more donations.<\/li>\n<li><strong>KickStarter may not be the best crowdsourcing venue for our project. <\/strong>The &#8220;all or nothing&#8221; nature of KickStarter, combined with some high profile KickStarter failures (that were making the rounds on news websites during our campaign) definitely hurt our chances of securing donations. This was especially true as our cause was not a &#8220;gadget&#8221; type product that enticed direct donations in exchange for a tangible product. We will continue to use crowdsourcing for our project, but we may seek alternatives to the KickStarter platform.<\/li>\n<\/ol>\n<h2>Our first major change is the way that we are going to structure our fundraisers.<\/h2>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter wp-image-387 size-large\" src=\"https:\/\/ostif.org\/wp-content\/uploads\/2016\/01\/Kickstarter-End-742x1024.png\" alt=\"Kickstarter End\" width=\"742\" height=\"1024\" srcset=\"https:\/\/ostif.org\/wp-content\/uploads\/2016\/01\/Kickstarter-End-742x1024.png 742w, https:\/\/ostif.org\/wp-content\/uploads\/2016\/01\/Kickstarter-End-217x300.png 217w, https:\/\/ostif.org\/wp-content\/uploads\/2016\/01\/Kickstarter-End-768x1060.png 768w, https:\/\/ostif.org\/wp-content\/uploads\/2016\/01\/Kickstarter-End.png 1000w\" sizes=\"(max-width: 742px) 100vw, 742px\" \/><\/p>\n<p>Working on these five areas should allow us to have much greater success going into 2016.  We will be posting more about our schedule and when and where you can find our next major fundraiser.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Our KickStarter has just ended and we have learned a lot about how to raise money for our supported projects. We faced a number of challenges that were difficult to overcome in the short window that we had while the KickStarter was live. We have extensively evaluated every aspect of the effort and got tons [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[65,66],"tags":[73,54,93],"_links":{"self":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts\/378"}],"collection":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/comments?post=378"}],"version-history":[{"count":8,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts\/378\/revisions"}],"predecessor-version":[{"id":389,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts\/378\/revisions\/389"}],"wp:attachment":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/media?parent=378"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/categories?post=378"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/tags?post=378"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}