{"id":800,"date":"2017-02-09T04:17:02","date_gmt":"2017-02-09T04:17:02","guid":{"rendered":"https:\/\/ostif.org\/?p=800"},"modified":"2019-05-23T01:03:39","modified_gmt":"2019-05-23T01:03:39","slug":"ostif-financial-report-for-fy2016","status":"publish","type":"post","link":"https:\/\/ostif.org\/ostif-financial-report-for-fy2016\/","title":{"rendered":"OSTIF Financial Report for FY2016"},"content":{"rendered":"<h1><a href=\"https:\/\/ostif.org\/?p=800&amp;preview=true\"><b>2015 and 2016 financial report for the Open Source Technology Improvement Fund, Inc.<\/b><\/a><\/h1>\n<p><span style=\"font-weight: 400;\">2016 was a year of rapid growth for OSTIF. We&#8217;ve met or exceeded all of our goals and have two major successes under our belts, the fundraising and auditing of VeraCrypt 1.18 and the fundraising and auditing of OpenVPN 2.4.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">This document is intended to inform our donors and the public about our operations and their related expenses. It is to show how our money is spent, and give ourselves a tool to evaluate how we are performing with regard to our goals and aspirations.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">Because this is our first full year of operation, we will be including our 2015 expenses and revenue in our figures displayed in this document. Because 2015 was a revenue-neutral year in which our activities were largely made up of planning our 2016 strategy and building our web assets, this will actually make our numbers look slightly worse for technology expenses and administrative spending. 2015 included a lot of one-time costs to form and register the corporation and attain non-profit status that will not be expenses for OSTIF in future years.<\/span><\/p>\n<p><b>Let’s start with our fundraising:<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Across 2015 and 2016 we raised a total of <\/span><b>$125,782<\/b><span style=\"font-weight: 400;\"> which greatly exceeded our expenses of <\/span><b>$94,544 <\/b><span style=\"font-weight: 400;\">This gives us an <\/span><i><span style=\"font-weight: 400;\">excess pool<\/span><\/i><span style=\"font-weight: 400;\"> of about $30,000 which we can apply toward our bug-bounty program. We are careful to use the word<\/span><i><span style=\"font-weight: 400;\"> about<\/span><\/i><span style=\"font-weight: 400;\"> because much of our holdings are currently in Bitcoins, and the exchange rate of BTC has fluctuated over 20% in the past few weeks, so the exact amount of our holdings fluctuates in value with the exchange rate.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">We found our stride in 2016 and our strategy of coalition building and bringing industry partners together to make effective change is going very well. We expect to continue this growth throughout 2017 and beyond!<\/span><\/p>\n<p><b>Expense breakdown and goals:<\/b><\/p>\n<p><span style=\"font-weight: 400;\">Across 2015 and 2016 we spent a total of $94,544 ($1,705 in 2015 and $92,838 in 2016). These expenses are broken down into 5 categories. You can see the categories and their descriptions below:<\/span><\/p>\n<table>\n<tbody>\n<tr>\n<td><span style=\"font-weight: 400;\">Charity<\/span><\/td>\n<td><span style=\"font-weight: 400;\">These are expenses that are related to our actual charitable activities. This spending is for auditing, bug bounties, and grants paid to projects that we support.<\/span><\/td>\n<\/tr>\n<tr>\n<td><span style=\"font-weight: 400;\">Administrative Costs<\/span><\/td>\n<td><span style=\"font-weight: 400;\">These are costs like keeping the corporation and its nonprofit status registered with state and federal agencies.<\/span><\/td>\n<\/tr>\n<tr>\n<td><span style=\"font-weight: 400;\">Pay<\/span><\/td>\n<td><span style=\"font-weight: 400;\">This is pay for our managers. Each manager does not draw a salary, but gets a bonus of 2% of the value of a fundraiser. This keeps our expenses low while still providing incentive to perform.<\/span><\/td>\n<\/tr>\n<tr>\n<td><span style=\"font-weight: 400;\">Technology Costs<\/span><\/td>\n<td><span style=\"font-weight: 400;\">This includes costs like consulting, web hosting, DDoS hardening, purchasing SSL certificates, and more.<\/span><\/td>\n<\/tr>\n<tr>\n<td><span style=\"font-weight: 400;\">Promotional Costs<\/span><\/td>\n<td><span style=\"font-weight: 400;\">These are small promotional costs for things like T-shirts and licensing for music\/art for OSTIF guide videos.<\/span><\/td>\n<\/tr>\n<\/tbody>\n<\/table>\n<p>&nbsp;<\/p>\n<p><span style=\"font-weight: 400;\">Expense breakdown:<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><span style=\"font-weight: 400;\"><br \/>\n<\/span><b>2015 and 2016 vs projections<\/b><\/p>\n<p><img decoding=\"async\" loading=\"lazy\" class=\"aligncenter size-large wp-image-801\" src=\"https:\/\/ostif.org\/wp-content\/uploads\/2017\/02\/pie-chart-comparison-1024x428.png\" alt=\"\" width=\"780\" height=\"326\" srcset=\"https:\/\/ostif.org\/wp-content\/uploads\/2017\/02\/pie-chart-comparison-1024x428.png 1024w, https:\/\/ostif.org\/wp-content\/uploads\/2017\/02\/pie-chart-comparison-300x125.png 300w, https:\/\/ostif.org\/wp-content\/uploads\/2017\/02\/pie-chart-comparison-768x321.png 768w\" sizes=\"(max-width: 780px) 100vw, 780px\" \/><\/p>\n<p><strong>On the left we have our original targets and on the right we have our results.<\/strong><\/p>\n<p><span style=\"font-weight: 400;\">We have beaten our goals that were laid out in 2015, even while including the large one-time costs of getting the organization started! Even after those costs, 91.2% of our revenue has gone directly to helping open-source projects get stronger (or is unspent waiting for the next project). Technology costs are our largest overhead expense, making up 1.5% of our expenses, with administrative costs next in line at 0.9% of our expenses. We spent so little on promotional costs that it cannot accurately be displayed on the chart. <\/span><\/p>\n<h2><span style=\"font-weight: 400;\">Looking Forward to 2017:<\/span><\/h2>\n<p><span style=\"font-weight: 400;\">We are expecting the percentages for all of these overhead costs to fall further in 2017 as our revenue grows. These are fixed expenses that <\/span><i><span style=\"font-weight: 400;\">do not<\/span><\/i><span style=\"font-weight: 400;\"> grow with the size of the organization. We will be looking for new opportunities for efficient spending and marketing in 2017 to help grow our charity and expand our reach. <\/span><\/p>\n<p><span style=\"font-weight: 400;\">We plan to greatly expand the educational side of our business throughout 2017 and will be more focused on guiding users on how to use our supported software. This may include new small costs like licenses for music, licenses for operating systems, the purchase of basic equipment for demonstrations, or other small expenses.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">We also expect some travel expenses to creep into our budget over time, as we will likely be attending trade shows and making in-person solicitations for support in mid to late 2017. This may also include small expenses like printing costs for brochures and business cards.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">We remain committed to our 90% efficiency target. We will continue to tightly control our expenses and <strong>keep costs low<\/strong>. We are proud to be among the most efficient charities of the world, and an increase in funding will only increase our performance per dollar.<\/span><\/p>\n<p><span style=\"font-weight: 400;\">I want to extend a special thank you to all of our early supporters who have helped make OSTIF a success. We look forward to working with the community to create a safe internet for all of us!<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>2015 and 2016 financial report for the Open Source Technology Improvement Fund, Inc. 2016 was a year of rapid growth for OSTIF. We&#8217;ve met or exceeded all of our goals and have two major successes under our belts, the fundraising and auditing of VeraCrypt 1.18 and the fundraising and auditing of OpenVPN 2.4. This document [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[65],"tags":[73,80],"_links":{"self":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts\/800"}],"collection":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/comments?post=800"}],"version-history":[{"count":4,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts\/800\/revisions"}],"predecessor-version":[{"id":805,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/posts\/800\/revisions\/805"}],"wp:attachment":[{"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/media?parent=800"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/categories?post=800"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/ostif.org\/wp-json\/wp\/v2\/tags?post=800"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}